#연산자

#page89

1.
a = int(input("첫 번째 수를 입력하시오."))
b = int(input("두 번째 수를 입력하시오."))
c = int(input("세 번째 수를 입력하시오."))

avg=0;
avg = (a+b+c)/3

print("세 수의 평균은", avg)
>>>
첫 번째 수를 입력하시오.10
두 번째 수를 입력하시오.20
세 번째 수를 입력하시오.30
세 수의 평균은 20.0

#page 91~

1.
x= 10;
y=20;

print("두 수의합 :",x+y)
print("두 수의차 :",x-y)
print("두 수의곱 :",x*y)
print("두 수의평균 :",(x+y)/2)
print("큰수 :",max(x,y))
print("작은수 :",min(x,y))
>>>
두 수의합 : 30
두 수의차 : -10
두 수의곱 : 200
두 수의평균 : 15.0
큰수 : 20
작은수 : 10

2.
r= int(input("원의 반지름은?"))
h = int(input("원의 높이는?"))

v = 3.141592*(r**2)*h

print("원기둥의 부피 :",v)
>>>
원의 반지름은?10
원의 높이는?100
원기둥의 부피 : 31415.92

3.
a = int (input("4자리숫자를 입력하시오"))

num = (a%10)+(a//10%10)+(a//100%10)+(a//1000)
print("자리수의 합:", num)
>>>
4자리숫자를 입력하시오1234
자리수의 합: 10

4.
x1 = int(input("x1 :"))
y1 = int(input("y1 :"))
x2 = int(input("x2 :"))
y2 = int(input("y2 :"))

num= ( (x1-x2)**2 + (y1-y2)**2 ) **0.5

print("두점 사이의 거리 :", num )
>>>
x1 :0
y1 :0
x2 :100
y2 :100
두점 사이의 거리 : 141.4213562373095

7.
import time

hour =  int(time.time()//60//60%24)
minute = int(time.time()//60%60)

print("현재 시간 (영국):", hour,"시",minute, "분")
>>>
현재 시간 (영국): 13 시 54 분

8.
w = int(input("물체의 무게를 입력하시오"))
s = int(input("물체의 속도를 입력하시오"))

e = 0.5*w*(s**2)

print("물체는" , e , "의 에너지를 가지고 있다")
>>>
물체의 무게를 입력하시오10
물체의 속도를 입력하시오100
물체는 50000.0 의 에너지를 가지고 있다
